       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO-WORLD-00.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World!".
           CALL 'FIBONACCI'
           STOP RUN.
       END PROGRAM HELLO-WORLD-00.
