       IDENTIFICATION DIVISION.
       PROGRAM-ID.   AFFICHEMSG.
       
       PROCEDURE DIVISION.
              PERFORM BONJOUR.
              PERFORM AUREVOIR.
              STOP RUN.
       
       BONJOUR.
              DISPLAY "Bonjour.".
       
       AUREVOIR.
              DISPLAY "À bientôt.".
              