       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALL-FIBONACCI.

       PROCEDURE DIVISION.
           DISPLAY "Calling fibonacci:".
           CALL 'FIBONACCI'
           STOP RUN.
       END PROGRAM CALL-FIBONACCI.